[
    {
        "name":"My Portfolio",
        "description":"This Portfolio site. 😊",
        "skills":["ReactJS","Tailwindcss"],
        "image":"eban-web/attendance.png",
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
            {
                "title":"YOU ARE ALREADY HERE",
                "link":null,
                "disabled": true
            }
        ]
    },
    {
        "name":"Pentecost Guide",
        "description":"A mobile application on Google Play Store which helps in reading through the Pentecost home cells and bible study for every year.I designed and built the mobile app and an admin web app to manage it. I used android studio with java to develop the mobile app. I also built the web admin using vuejs. both uses firebase as backend. i built an offline feature that helps readers on the app to keep the content offline permanently.",
        "skills":["Native Android","Java","Android Studio", "VueJs"],
        "image":"eban-web/attendance.png",
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
            {
                "title":"PLAYS STORE",
                "link":"https://play.google.com/store/apps/details?id=com.jolsoft.pentecostguid"
            }
        ]
    },
    {
        "name":"Eban Register (Mobile)",
        "description":" built a mobile app used by employees and members of enrolled organizations to: (1) scan QRCodes to take attendance. (2) manage their profile. (3) register attendance for meetings within the radius of their gps location. (4) Access their organisation's information and meetings. (5) manage their attendance history.",
        "image":"eban-web/attendance.png",
        "skills":["Flutter", "Dart"],
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
            {
                "title":"APP STORE",
                "link":"https://apps.apple.com/gh/app/eban-register/id1533556318?itsct=apps_box&itscg=30200"
            },
            {
                "title":"PLAY STORE",
                "link":"https://play.google.com/store/apps/details?id=com.eban.ebanapp"
            }
        ]
    },
    {
        "name":"Eban Register (Web Admin)",
        "description":"An Electronic attendance system. 70 organizations has enrolled on the platform since it's deployment in december 2020. the system allows employees or member of organizations to take attendance with their phone by scanning a QR-Code, using their GPS or scanning an NFC tag",
        "image":"eban-web/attendance.png",
        "skills":["VueJs", "Bootstrap","FeathersJs", "Typescript", "more.."],
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
            {
                "title":"LINK",
                "link":"https://ebanregister.com/"
            }
        ]
    },
    {
        "name":"E-Health",
        "description":"The Project is a hospital management system. I was in both the frontend team and backend team. I developed the core backend modules for authentication (with passport), billing, and other hospital operations. The backend is developed in php (Laravel). I was also part of the frontend team. i developed the frontend custom controls, authentication, billing and other operations that communicate with the backend using rest.",
        "image":"eban-web/attendance.png",
        "skills":["EmberJs", "PHP","Laravel", "Mysql", "HTML, JS, CSS"],
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
        ]
    },
    {
        "name":"Rotary Eyesight",
        "description":"The is a system donated by Rotary International to Ghana Health Service. I developed the web admin in vuejs, a backend in feathersjs (node/expresjs framework) and a mobile app in flutter. The web app is a web console to manage the administrative operations of the system. the system is a health surveillance system to collect data on people with eyesight issues and refer them to hospitals through the system. the mobile app is for the data collections and diagnosis.",
        "image":"eban-web/attendance.png",
        "skills":["Flutter", "VueJs", "FeathersJS", "Typescript", "HTML, JS, CSS"],
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
        ]
    },
    {
        "name":"SORMAS",
        "description":"Besides Germany, SORMAS is now being used in over half a dozen countries for COVID surveillance. I contribute to the development of SORMAS by developing features like barcode reading, and some other requirements. I also built custom controls for the mobile app. i used eclipse or sometimes intellij with javaee and vaadin framework to build the web application feature tasks like new sample dashboard and other features. I also made fixed bugs in the project and create pull requests.",
        "image":"eban-web/attendance.png",
        "skills":["Java","Android Studio","Vaadin"],
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
            {
                "title":"SITE",
                "link":"https://sormas.org/"
            },
            {
                "title":"DEMO",
                "link":"https://demo.sormas.org/sormas-ui/login"
            }
        ]
    },
    {
        "name":"U4Africa",
        "description":"A multi-national payment system developed to target African coutries.",
        "skills":["Ionic","HTML", "Javascript", "CSS"],
        "image":"eban-web/attendance.png",
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
        ]
    },
    {
        "name":"JShop POS",
        "description":"This is a POS application that runs on windows. I built this desktop POS application using c# DotNet winforms. it connects to a mysql database and run on the local machine. The app has so far been deployed to 26 shops in Ghana. Its has features like, user management, sales, inventory, customer management and reporting.",
        "image":"eban-web/attendance.png",
        "skills":["C#",".Net","MySql"],
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
        ]
    },
    {
        "name":"Windows Timer",
        "description":"Windows Timer is an application that performs system action like alert, shutdown, hibernate, lock, sleep, and restart after a count down or a scheduled time. it has 4 main sections. (1) section for counting up to a particular time. (2) section for counting down to a particular time. (3) section for scheduling an action. (4) section for the application settings. I built the application using c# .net winforms.",
        "image":"eban-web/attendance.png",
        "skills":["C#",".Net"],
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
            {
                "title":"REPO",
                "link":"https://github.com/opatajoshua/Windows-Shutdown-Timer"
            }
        ]
    },
    {
        "name":"Wyre PayLink",
        "description":"A mobile front-end application to a payment system in Ghana. I was part of the ui design theme and also the mobile developer. I built the mobile app with ionic. The app generates links to users which they can share to other to make payments to. It fetches user details, transaction details and initiates new transactions.",
        "skills":["Ionic","HTML", "Javascript", "CSS"],
        "image":"eban-web/attendance.png",
        "images":[
            "eban-web/attendance.png"
        ],
        "links":[
        ]
    }
]